Changing to mermaid.
